In [2]:
import numpy as np
import pandas as pd

In [15]:
# Задание 1

dat = np.array([['Dmitry Chernov', 16, '10I1', 'chess'], ['Egor Lyesin', 16, '10A1', 'football']])
df = pd.DataFrame(dat, columns=['name', 'age', 'class', 'hobbie'])
df

             name age class    hobbie
0  Dmitry Chernov  16  10I1     chess
1     Egor Lyesin  16  10A1  football

In [22]:
# Задание 2
df = df.drop('hobbie', axis=1)
df

             name age class
0  Dmitry Chernov  16  10I1
1     Egor Lyesin  16  10A1